# Area Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
EnergyAnalysisSpace..::..Area Property
EnergyAnalysisSpace Class See Also
---
The area for this space.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# Remarks
This value is the enclosed area measured by interior bounding surfaces.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace